_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 200)               72800     
_________________________________________________________________
dense_2 (Dense)              (None, 50)                10050     
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 153       
=================================================================
Total params: 83,003
Trainable params: 83,003
Non-trainable params: 0
_________________________________________________________________